FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/utilities/fsl_str.c
/*
 * Copyright 2017 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */
#include <math.h>
#include <stdarg.h>
#include <stdlib.h>
#include "fsl_str.h"
#include "fsl_debug_console_conf.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief The overflow value.*/
#ifndef HUGE_VAL
    #define HUGE_VAL    ( 99.e99 )
#endif /* HUGE_VAL */

#if PRINTF_ADVANCED_ENABLE
/*! @brief Specification modifier flags for printf. */
    enum _debugconsole_printf_flag
    {
        kPRINTF_Minus = 0x01U,              /*!< Minus FLag. */
        kPRINTF_Plus = 0x02U,               /*!< Plus Flag. */
        kPRINTF_Space = 0x04U,              /*!< Space Flag. */
        kPRINTF_Zero = 0x08U,               /*!< Zero Flag. */
        kPRINTF_Pound = 0x10U,              /*!< Pound Flag. */
        kPRINTF_LengthChar = 0x20U,         /*!< Length: Char Flag. */
        kPRINTF_LengthShortInt = 0x40U,     /*!< Length: Short Int Flag. */
        kPRINTF_LengthLongInt = 0x80U,      /*!< Length: Long Int Flag. */
        kPRINTF_LengthLongLongInt = 0x100U, /*!< Length: Long Long Int Flag. */
    };
#endif /* PRINTF_ADVANCED_ENABLE */

/*! @brief Specification modifier flags for scanf. */
enum _debugconsole_scanf_flag
{
    kSCANF_Suppress = 0x2U,                /*!< Suppress Flag. */
    kSCANF_DestMask = 0x7cU,               /*!< Destination Mask. */
    kSCANF_DestChar = 0x4U,                /*!< Destination Char Flag. */
    kSCANF_DestString = 0x8U,              /*!< Destination String FLag. */
    kSCANF_DestSet = 0x10U,                /*!< Destination Set Flag. */
    kSCANF_DestInt = 0x20U,                /*!< Destination Int Flag. */
    kSCANF_DestFloat = 0x30U,              /*!< Destination Float Flag. */
    kSCANF_LengthMask = 0x1f00U,           /*!< Length Mask Flag. */
    #if SCANF_ADVANCED_ENABLE
        kSCANF_LengthChar = 0x100U,        /*!< Length Char Flag. */
        kSCANF_LengthShortInt = 0x200U,    /*!< Length ShortInt Flag. */
        kSCANF_LengthLongInt = 0x400U,     /*!< Length LongInt Flag. */
        kSCANF_LengthLongLongInt = 0x800U, /*!< Length LongLongInt Flag. */
    #endif /* SCANF_ADVANCED_ENABLE */
    #if SCANF_FLOAT_ENABLE
        kSCANF_LengthLongLongDouble = 0x1000U, /*!< Length LongLongDuoble Flag. */
    #endif /*PRINTF_FLOAT_ENABLE */
    kSCANF_TypeSinged = 0x2000U,               /*!< TypeSinged Flag. */
};

/*! @brief Keil: suppress ellipsis warning in va_arg usage below. */
#if defined( __CC_ARM )
    #pragma diag_suppress 1256
#endif /* __CC_ARM */

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*!
 * @brief Scanline function which ignores white spaces.
 *
 * @param[in]   s The address of the string pointer to update.
 * @return      String without white spaces.
 */
static uint32_t ScanIgnoreWhiteSpace( const char ** s );

/*!
 * @brief Converts a radix number to a string and return its length.
 *
 * @param[in] numstr    Converted string of the number.
 * @param[in] nump      Pointer to the number.
 * @param[in] neg       Polarity of the number.
 * @param[in] radix     The radix to be converted to.
 * @param[in] use_caps  Used to identify %x/X output format.
 *
 * @return Length of the converted string.
 */
static int32_t ConvertRadixNumToString( char * numstr,
                                        void * nump,
                                        int32_t neg,
                                        int32_t radix,
                                        bool use_caps );

#if PRINTF_FLOAT_ENABLE

/*!
 * @brief Converts a floating radix number to a string and return its length.
 *
 * @param[in] numstr            Converted string of the number.
 * @param[in] nump              Pointer to the number.
 * @param[in] radix             The radix to be converted to.
 * @param[in] precision_width   Specify the precision width.
 *
 * @return Length of the converted string.
 */
    static int32_t ConvertFloatRadixNumToString( char * numstr,
                                                 void * nump,
                                                 int32_t radix,
                                                 uint32_t precision_width );
#endif /* PRINTF_FLOAT_ENABLE */

/*!
 *
 */
double modf( double input_dbl,
             double * intpart_ptr );

/*************Code for process formatted data*******************************/

static uint32_t ScanIgnoreWhiteSpace( const char ** s )
{
    uint8_t count = 0;
    uint8_t c;

    c = **s;

    while( ( c == ' ' ) || ( c == '\t' ) || ( c == '\n' ) || ( c == '\r' ) || ( c == '\v' ) || ( c == '\f' ) )
    {
        count++;
        ( *s )++;
        c = **s;
    }

    return count;
}

static int32_t ConvertRadixNumToString( char * numstr,
                                        void * nump,
                                        int32_t neg,
                                        int32_t radix,
                                        bool use_caps )
{
    #if PRINTF_ADVANCED_ENABLE
        int64_t a;
        int64_t b;
        int64_t c;

        uint64_t ua;
        uint64_t ub;
        uint64_t uc;
    #else
        int32_t a;
        int32_t b;
        int32_t c;

        uint32_t ua;
        uint32_t ub;
        uint32_t uc;
    #endif /* PRINTF_ADVANCED_ENABLE */

    int32_t nlen;
    char * nstrp;

    nlen = 0;
    nstrp = numstr;
    *nstrp++ = '\0';

    if( neg )
    {
        #if PRINTF_ADVANCED_ENABLE
            a = *( int64_t * ) nump;
        #else
            a = *( int32_t * ) nump;
        #endif /* PRINTF_ADVANCED_ENABLE */

        if( a == 0 )
        {
            *nstrp = '0';
            ++nlen;
            return nlen;
        }

        while( a != 0 )
        {
            #if PRINTF_ADVANCED_ENABLE
                b = ( int64_t ) a / ( int64_t ) radix;
                c = ( int64_t ) a - ( ( int64_t ) b * ( int64_t ) radix );

                if( c < 0 )
                {
                    uc = ( uint64_t ) c;
                    c = ( int64_t ) ( ~uc ) + 1 + '0';
                }
            #else
                b = a / radix;
                c = a - ( b * radix );

                if( c < 0 )
                {
                    uc = ( uint32_t ) c;
                    c = ( uint32_t ) ( ~uc ) + 1 + '0';
                }
            #endif /* PRINTF_ADVANCED_ENABLE */
            else
            {
                c = c + '0';
            }
            a = b;
            *nstrp++ = ( char ) c;
            ++nlen;
        }
    }
    else
    {
        #if PRINTF_ADVANCED_ENABLE
            ua = *( uint64_t * ) nump;
        #else
            ua = *( uint32_t * ) nump;
        #endif /* PRINTF_ADVANCED_ENABLE */

        if( ua == 0 )
        {
            *nstrp = '0';
            ++nlen;
            return nlen;
        }

