FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/utilities/fsl_str.c
        while( ua != 0 )
        {
            #if PRINTF_ADVANCED_ENABLE
                ub = ( uint64_t ) ua / ( uint64_t ) radix;
                uc = ( uint64_t ) ua - ( ( uint64_t ) ub * ( uint64_t ) radix );
            #else
                ub = ua / ( uint32_t ) radix;
                uc = ua - ( ub * ( uint32_t ) radix );
            #endif /* PRINTF_ADVANCED_ENABLE */

            if( uc < 10 )
            {
                uc = uc + '0';
            }
            else
            {
                uc = uc - 10 + ( use_caps ? 'A' : 'a' );
            }

            ua = ub;
            *nstrp++ = ( char ) uc;
            ++nlen;
        }
    }

    return nlen;
}

#if PRINTF_FLOAT_ENABLE
    static int32_t ConvertFloatRadixNumToString( char * numstr,
                                                 void * nump,
                                                 int32_t radix,
                                                 uint32_t precision_width )
    {
        int32_t a;
        int32_t b;
        int32_t c;
        int32_t i;
        uint32_t uc;
        double fa;
        double dc;
        double fb;
        double r;
        double fractpart;
        double intpart;

        int32_t nlen;
        char * nstrp;

        nlen = 0;
        nstrp = numstr;
        *nstrp++ = '\0';
        r = *( double * ) nump;

        if( !r )
        {
            *nstrp = '0';
            ++nlen;
            return nlen;
        }

        fractpart = modf( ( double ) r, ( double * ) &intpart );

        /* Process fractional part. */
        for( i = 0; i < precision_width; i++ )
        {
            fractpart *= radix;
        }

        if( r >= 0 )
        {
            fa = fractpart + ( double ) 0.5;

            if( fa >= pow( 10, precision_width ) )
            {
                intpart++;
            }
        }
        else
        {
            fa = fractpart - ( double ) 0.5;

            if( fa <= -pow( 10, precision_width ) )
            {
                intpart--;
            }
        }

        for( i = 0; i < precision_width; i++ )
        {
            fb = fa / ( int32_t ) radix;
            dc = ( fa - ( int64_t ) fb * ( int32_t ) radix );
            c = ( int32_t ) dc;

            if( c < 0 )
            {
                uc = ( uint32_t ) c;
                c = ( int32_t ) ( ~uc ) + 1 + '0';
            }
            else
            {
                c = c + '0';
            }

            fa = fb;
            *nstrp++ = ( char ) c;
            ++nlen;
        }

        *nstrp++ = ( char ) '.';
        ++nlen;
        a = ( int32_t ) intpart;

        if( a == 0 )
        {
            *nstrp++ = '0';
            ++nlen;
        }
        else
        {
            while( a != 0 )
            {
                b = ( int32_t ) a / ( int32_t ) radix;
                c = ( int32_t ) a - ( ( int32_t ) b * ( int32_t ) radix );

                if( c < 0 )
                {
                    uc = ( uint32_t ) c;
                    c = ( int32_t ) ( ~uc ) + 1 + '0';
                }
                else
                {
                    c = c + '0';
                }

                a = b;
                *nstrp++ = ( char ) c;
                ++nlen;
            }
        }

        return nlen;
    }
#endif /* PRINTF_FLOAT_ENABLE */

/*!
 * brief This function outputs its parameters according to a formatted string.
 *
 * note I/O is performed by calling given function pointer using following
 * (*func_ptr)(c);
 *
 * param[in] fmt_ptr   Format string for printf.
 * param[in] args_ptr  Arguments to printf.
 * param[in] buf  pointer to the buffer
 * param cb print callback function pointer
 *
 * return Number of characters to be print
 */
int StrFormatPrintf( const char * fmt,
                     va_list ap,
                     char * buf,
                     printfCb cb )
{
    /* va_list ap; */
    char * p;
    int32_t c;

    char vstr[ 33 ];
    char * vstrp = NULL;
    int32_t vlen = 0;

    int32_t done;
    int32_t count = 0;

    uint32_t field_width;
    uint32_t precision_width;
    char * sval;
    int32_t cval;
    bool use_caps;
    uint8_t radix = 0;

    #if PRINTF_ADVANCED_ENABLE
        uint32_t flags_used;
        int32_t schar, dschar;
        int64_t ival;
        uint64_t uval = 0;
        bool valid_precision_width;
    #else
        int32_t ival;
        uint32_t uval = 0;
    #endif /* PRINTF_ADVANCED_ENABLE */

    #if PRINTF_FLOAT_ENABLE
        double fval;
    #endif /* PRINTF_FLOAT_ENABLE */

    /* Start parsing apart the format string and display appropriate formats and data. */
    for( p = ( char * ) fmt; ( c = *p ) != 0; p++ )
    {
        /*
         * All formats begin with a '%' marker.  Special chars like
         * '\n' or '\t' are normally converted to the appropriate
         * character by the __compiler__.  Thus, no need for this
         * routine to account for the '\' character.
         */
        if( c != '%' )
        {
            cb( buf, &count, c, 1 );
            /* By using 'continue', the next iteration of the loop is used, skipping the code that follows. */
            continue;
        }

        use_caps = true;

        #if PRINTF_ADVANCED_ENABLE
            /* First check for specification modifier flags. */
            flags_used = 0;
            done = false;

            while( !done )
            {
                switch( *++p )
                {
                    case '-':
                        flags_used |= kPRINTF_Minus;
                        break;

                    case '+':
                        flags_used |= kPRINTF_Plus;
                        break;

                    case ' ':
                        flags_used |= kPRINTF_Space;
                        break;

                    case '0':
                        flags_used |= kPRINTF_Zero;
                        break;

                    case '#':
                        flags_used |= kPRINTF_Pound;
                        break;

                    default:
                        /* We've gone one char too far. */
                        --p;
                        done = true;
                        break;
                }
            }
        #endif /* PRINTF_ADVANCED_ENABLE */

