FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/utilities/fsl_str.c
        /* Next check for minimum field width. */
        field_width = 0;
        done = false;

        while( !done )
        {
            c = *++p;

            if( ( c >= '0' ) && ( c <= '9' ) )
            {
                field_width = ( field_width * 10 ) + ( c - '0' );
            }

            #if PRINTF_ADVANCED_ENABLE
                else if( c == '*' )
                {
                    field_width = ( uint32_t ) va_arg( ap, uint32_t );
                }
            #endif /* PRINTF_ADVANCED_ENABLE */
            else
            {
                /* We've gone one char too far. */
                --p;
                done = true;
            }
        }

        /* Next check for the width and precision field separator. */
        precision_width = 6;
        #if PRINTF_ADVANCED_ENABLE
            valid_precision_width = false;
        #endif /* PRINTF_ADVANCED_ENABLE */

        if( *++p == '.' )
        {
            /* Must get precision field width, if present. */
            precision_width = 0;
            done = false;

            while( !done )
            {
                c = *++p;

                if( ( c >= '0' ) && ( c <= '9' ) )
                {
                    precision_width = ( precision_width * 10 ) + ( c - '0' );
                    #if PRINTF_ADVANCED_ENABLE
                        valid_precision_width = true;
                    #endif /* PRINTF_ADVANCED_ENABLE */
                }

                #if PRINTF_ADVANCED_ENABLE
                    else if( c == '*' )
                    {
                        precision_width = ( uint32_t ) va_arg( ap, uint32_t );
                        valid_precision_width = true;
                    }
                #endif /* PRINTF_ADVANCED_ENABLE */
                else
                {
                    /* We've gone one char too far. */
                    --p;
                    done = true;
                }
            }
        }
        else
        {
            /* We've gone one char too far. */
            --p;
        }

        #if PRINTF_ADVANCED_ENABLE

            /*
             * Check for the length modifier.
             */
            switch( /* c = */ *++p )
            {
                case 'h':

                    if( *++p != 'h' )
                    {
                        flags_used |= kPRINTF_LengthShortInt;
                        --p;
                    }
                    else
                    {
                        flags_used |= kPRINTF_LengthChar;
                    }

                    break;

                case 'l':

                    if( *++p != 'l' )
                    {
                        flags_used |= kPRINTF_LengthLongInt;
                        --p;
                    }
                    else
                    {
                        flags_used |= kPRINTF_LengthLongLongInt;
                    }

                    break;

                default:
                    /* we've gone one char too far */
                    --p;
                    break;
            }
        #endif /* PRINTF_ADVANCED_ENABLE */
        /* Now we're ready to examine the format. */
        c = *++p;
        {
            if( ( c == 'd' ) || ( c == 'i' ) || ( c == 'f' ) || ( c == 'F' ) || ( c == 'x' ) || ( c == 'X' ) || ( c == 'o' ) ||
                ( c == 'b' ) || ( c == 'p' ) || ( c == 'u' ) )
            {
                if( ( c == 'd' ) || ( c == 'i' ) )
                {
                    #if PRINTF_ADVANCED_ENABLE
                        if( flags_used & kPRINTF_LengthLongLongInt )
                        {
                            ival = ( int64_t ) va_arg( ap, int64_t );
                        }
                        else
                    #endif /* PRINTF_ADVANCED_ENABLE */
                    {
                        ival = ( int32_t ) va_arg( ap, int32_t );
                    }

                    vlen = ConvertRadixNumToString( vstr, &ival, true, 10, use_caps );
                    vstrp = &vstr[ vlen ];
                    #if PRINTF_ADVANCED_ENABLE
                        if( ival < 0 )
                        {
                            schar = '-';
                            ++vlen;
                        }
                        else
                        {
                            if( flags_used & kPRINTF_Plus )
                            {
                                schar = '+';
                                ++vlen;
                            }
                            else
                            {
                                if( flags_used & kPRINTF_Space )
                                {
                                    schar = ' ';
                                    ++vlen;
                                }
                                else
                                {
                                    schar = 0;
                                }
                            }
                        }

                        dschar = false;

                        /* Do the ZERO pad. */
                        if( flags_used & kPRINTF_Zero )
                        {
                            if( schar )
                            {
                                cb( buf, &count, schar, 1 );
                            }

                            dschar = true;

                            cb( buf, &count, '0', field_width - vlen );
                            vlen = field_width;
                        }
                        else
                        {
                            if( !( flags_used & kPRINTF_Minus ) )
                            {
                                cb( buf, &count, ' ', field_width - vlen );

                                if( schar )
                                {
                                    cb( buf, &count, schar, 1 );
                                }

                                dschar = true;
                            }
                        }

