FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/utilities/fsl_str.c
                        /* The string was built in reverse order, now display in correct order. */
                        if( ( !dschar ) && schar )
                        {
                            cb( buf, &count, schar, 1 );
                        }
                    #endif /* PRINTF_ADVANCED_ENABLE */
                }

                #if PRINTF_FLOAT_ENABLE
                    if( ( c == 'f' ) || ( c == 'F' ) )
                    {
                        fval = ( double ) va_arg( ap, double );
                        vlen = ConvertFloatRadixNumToString( vstr, &fval, 10, precision_width );
                        vstrp = &vstr[ vlen ];

                        #if PRINTF_ADVANCED_ENABLE
                            if( fval < 0 )
                            {
                                schar = '-';
                                ++vlen;
                            }
                            else
                            {
                                if( flags_used & kPRINTF_Plus )
                                {
                                    schar = '+';
                                    ++vlen;
                                }
                                else
                                {
                                    if( flags_used & kPRINTF_Space )
                                    {
                                        schar = ' ';
                                        ++vlen;
                                    }
                                    else
                                    {
                                        schar = 0;
                                    }
                                }
                            }

                            dschar = false;

                            if( flags_used & kPRINTF_Zero )
                            {
                                if( schar )
                                {
                                    cb( buf, &count, schar, 1 );
                                }

                                dschar = true;
                                cb( buf, &count, '0', field_width - vlen );
                                vlen = field_width;
                            }
                            else
                            {
                                if( !( flags_used & kPRINTF_Minus ) )
                                {
                                    cb( buf, &count, ' ', field_width - vlen );

                                    if( schar )
                                    {
                                        cb( buf, &count, schar, 1 );
                                    }

                                    dschar = true;
                                }
                            }

                            if( ( !dschar ) && schar )
                            {
                                cb( buf, &count, schar, 1 );
                            }
                        #endif /* PRINTF_ADVANCED_ENABLE */
                    }
                #endif /* PRINTF_FLOAT_ENABLE */

                if( ( c == 'X' ) || ( c == 'x' ) )
                {
                    if( c == 'x' )
                    {
                        use_caps = false;
                    }

                    #if PRINTF_ADVANCED_ENABLE
                        if( flags_used & kPRINTF_LengthLongLongInt )
                        {
                            uval = ( uint64_t ) va_arg( ap, uint64_t );
                        }
                        else
                    #endif /* PRINTF_ADVANCED_ENABLE */
                    {
                        uval = ( uint32_t ) va_arg( ap, uint32_t );
                    }

                    vlen = ConvertRadixNumToString( vstr, &uval, false, 16, use_caps );
                    vstrp = &vstr[ vlen ];

                    #if PRINTF_ADVANCED_ENABLE
                        dschar = false;

                        if( flags_used & kPRINTF_Zero )
                        {
                            if( flags_used & kPRINTF_Pound )
                            {
                                cb( buf, &count, '0', 1 );
                                cb( buf, &count, ( use_caps ? 'X' : 'x' ), 1 );
                                dschar = true;
                            }

                            cb( buf, &count, '0', field_width - vlen );
                            vlen = field_width;
                        }
                        else
                        {
                            if( !( flags_used & kPRINTF_Minus ) )
                            {
                                if( flags_used & kPRINTF_Pound )
                                {
                                    vlen += 2;
                                }

                                cb( buf, &count, ' ', field_width - vlen );

                                if( flags_used & kPRINTF_Pound )
                                {
                                    cb( buf, &count, '0', 1 );
                                    cb( buf, &count, ( use_caps ? 'X' : 'x' ), 1 );
                                    dschar = true;
                                }
                            }
                        }

                        if( ( flags_used & kPRINTF_Pound ) && ( !dschar ) )
                        {
                            cb( buf, &count, '0', 1 );
                            cb( buf, &count, ( use_caps ? 'X' : 'x' ), 1 );
                            vlen += 2;
                        }
                    #endif /* PRINTF_ADVANCED_ENABLE */
                }

                if( ( c == 'o' ) || ( c == 'b' ) || ( c == 'p' ) || ( c == 'u' ) )
                {
                    #if PRINTF_ADVANCED_ENABLE
                        if( flags_used & kPRINTF_LengthLongLongInt )
                        {
                            uval = ( uint64_t ) va_arg( ap, uint64_t );
                        }
                        else
                    #endif /* PRINTF_ADVANCED_ENABLE */
                    {
                        uval = ( uint32_t ) va_arg( ap, uint32_t );
                    }

                    if( c == 'o' )
                    {
                        radix = 8;
                    }
                    else if( c == 'b' )
                    {
                        radix = 2;
                    }
                    else if( c == 'p' )
                    {
                        radix = 16;
                    }
                    else
                    {
                        radix = 10;
                    }

                    vlen = ConvertRadixNumToString( vstr, &uval, false, radix, use_caps );
                    vstrp = &vstr[ vlen ];
                    #if PRINTF_ADVANCED_ENABLE
                        if( flags_used & kPRINTF_Zero )
                        {
                            cb( buf, &count, '0', field_width - vlen );
                            vlen = field_width;
                        }
                        else
                        {
                            if( !( flags_used & kPRINTF_Minus ) )
                            {
                                cb( buf, &count, ' ', field_width - vlen );
                            }
                        }
                    #endif /* PRINTF_ADVANCED_ENABLE */
                }

