FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/utilities/fsl_str.c
                #if !PRINTF_ADVANCED_ENABLE
                    cb( buf, &count, ' ', field_width - vlen );
                #endif /* !PRINTF_ADVANCED_ENABLE */

                if( vstrp != NULL )
                {
                    while( *vstrp )
                    {
                        cb( buf, &count, *vstrp--, 1 );
                    }
                }

                #if PRINTF_ADVANCED_ENABLE
                    if( flags_used & kPRINTF_Minus )
                    {
                        cb( buf, &count, ' ', field_width - vlen );
                    }
                #endif /* PRINTF_ADVANCED_ENABLE */
            }
            else if( c == 'c' )
            {
                cval = ( char ) va_arg( ap, uint32_t );
                cb( buf, &count, cval, 1 );
            }
            else if( c == 's' )
            {
                sval = ( char * ) va_arg( ap, char * );

                if( sval )
                {
                    #if PRINTF_ADVANCED_ENABLE
                        if( valid_precision_width )
                        {
                            vlen = precision_width;
                        }
                        else
                        {
                            vlen = strlen( sval );
                        }
                    #else
                        vlen = strlen( sval );
                    #endif /* PRINTF_ADVANCED_ENABLE */
                    #if PRINTF_ADVANCED_ENABLE
                        if( !( flags_used & kPRINTF_Minus ) )
                    #endif /* PRINTF_ADVANCED_ENABLE */
                    {
                        cb( buf, &count, ' ', field_width - vlen );
                    }

                    #if PRINTF_ADVANCED_ENABLE
                        if( valid_precision_width )
                        {
                            while( ( *sval ) && ( vlen > 0 ) )
                            {
                                cb( buf, &count, *sval++, 1 );
                                vlen--;
                            }

                            /* In case that vlen sval is shorter than vlen */
                            vlen = precision_width - vlen;
                        }
                        else
                        {
                    #endif /* PRINTF_ADVANCED_ENABLE */

                    while( *sval )
                    {
                        cb( buf, &count, *sval++, 1 );
                    }

                    #if PRINTF_ADVANCED_ENABLE
                }
                    #endif /* PRINTF_ADVANCED_ENABLE */

                    #if PRINTF_ADVANCED_ENABLE
                        if( flags_used & kPRINTF_Minus )
                        {
                            cb( buf, &count, ' ', field_width - vlen );
                        }
                    #endif /* PRINTF_ADVANCED_ENABLE */
                }
            }
            else
            {
                cb( buf, &count, c, 1 );
            }
        }
    }

    return count;
}

/*!
 * brief Converts an input line of ASCII characters based upon a provided
 * string format.
 *
 * param[in] line_ptr The input line of ASCII data.
 * param[in] format   Format first points to the format string.
 * param[in] args_ptr The list of parameters.
 *
 * return Number of input items converted and assigned.
 * retval IO_EOF When line_ptr is empty string "".
 */
int StrFormatScanf( const char * line_ptr,
                    char * format,
                    va_list args_ptr )
{
    uint8_t base;
    int8_t neg;
    /* Identifier for the format string. */
    char * c = format;
    char temp;
    char * buf;
    /* Flag telling the conversion specification. */
    uint32_t flag = 0;
    /* Filed width for the matching input streams. */
    uint32_t field_width;
    /* How many arguments are assigned except the suppress. */
    uint32_t nassigned = 0;
    /* How many characters are read from the input streams. */
    uint32_t n_decode = 0;

    int32_t val;

    const char * s;
    /* Identifier for the input string. */
    const char * p = line_ptr;

    #if SCANF_FLOAT_ENABLE
        double fnum = 0.0;
    #endif /* SCANF_FLOAT_ENABLE */

    /* Return EOF error before any conversion. */
    if( *p == '\0' )
    {
        return -1;
    }

    /* Decode directives. */
    while( ( *c ) && ( *p ) )
    {
        /* Ignore all white-spaces in the format strings. */
        if( ScanIgnoreWhiteSpace( ( const char ** ) &c ) )
        {
            n_decode += ScanIgnoreWhiteSpace( &p );
        }
        else if( ( *c != '%' ) || ( ( *c == '%' ) && ( *( c + 1 ) == '%' ) ) )
        {
            /* Ordinary characters. */
            c++;

            if( *p == *c )
            {
                n_decode++;
                p++;
                c++;
            }
            else
            {
                /* Match failure. Misalignment with C99, the unmatched characters need to be pushed back to stream.
                 * However, it is deserted now. */
                break;
            }
        }
        else
        {
            /* convernsion specification */
            c++;
            /* Reset. */
            flag = 0;
            field_width = 0;
            base = 0;

            /* Loop to get full conversion specification. */
            while( ( *c ) && ( !( flag & kSCANF_DestMask ) ) )
            {
                switch( *c )
                {
                    #if SCANF_ADVANCED_ENABLE
                        case '*':

                            if( flag & kSCANF_Suppress )
                            {
                                /* Match failure. */
                                return nassigned;
                            }

                            flag |= kSCANF_Suppress;
                            c++;
                            break;

                        case 'h':

                            if( flag & kSCANF_LengthMask )
                            {
                                /* Match failure. */
                                return nassigned;
                            }

                            if( c[ 1 ] == 'h' )
                            {
                                flag |= kSCANF_LengthChar;
                                c++;
                            }
                            else
                            {
                                flag |= kSCANF_LengthShortInt;
                            }

                            c++;
                            break;

                        case 'l':

                            if( flag & kSCANF_LengthMask )
                            {
                                /* Match failure. */
                                return nassigned;
                            }

                            if( c[ 1 ] == 'l' )
                            {
                                flag |= kSCANF_LengthLongLongInt;
                                c++;
                            }
                            else
                            {
                                flag |= kSCANF_LengthLongInt;
                            }

                            c++;
                            break;
                    #endif /* SCANF_ADVANCED_ENABLE */
                    #if SCANF_FLOAT_ENABLE
                        case 'L':

                            if( flag & kSCANF_LengthMask )
                            {
                                /* Match failure. */
                                return nassigned;
                            }

