FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/utilities/fsl_str.c
                            flag |= kSCANF_LengthLongLongDouble;
                            c++;
                            break;
                    #endif /* SCANF_FLOAT_ENABLE */
                    case '0':
                    case '1':
                    case '2':
                    case '3':
                    case '4':
                    case '5':
                    case '6':
                    case '7':
                    case '8':
                    case '9':

                        if( field_width )
                        {
                            /* Match failure. */
                            return nassigned;
                        }

                        do
                        {
                            field_width = field_width * 10 + *c - '0';
                            c++;
                        } while( ( *c >= '0' ) && ( *c <= '9' ) );

                        break;

                    case 'd':
                        base = 10;
                        flag |= kSCANF_TypeSinged;
                        flag |= kSCANF_DestInt;
                        c++;
                        break;

                    case 'u':
                        base = 10;
                        flag |= kSCANF_DestInt;
                        c++;
                        break;

                    case 'o':
                        base = 8;
                        flag |= kSCANF_DestInt;
                        c++;
                        break;

                    case 'x':
                    case 'X':
                        base = 16;
                        flag |= kSCANF_DestInt;
                        c++;
                        break;

                    case 'i':
                        base = 0;
                        flag |= kSCANF_DestInt;
                        c++;
                        break;

                        #if SCANF_FLOAT_ENABLE
                            case 'a':
                            case 'A':
                            case 'e':
                            case 'E':
                            case 'f':
                            case 'F':
                            case 'g':
                            case 'G':
                                flag |= kSCANF_DestFloat;
                                c++;
                                break;
                        #endif /* SCANF_FLOAT_ENABLE */
                    case 'c':
                        flag |= kSCANF_DestChar;

                        if( !field_width )
                        {
                            field_width = 1;
                        }

                        c++;
                        break;

                    case 's':
                        flag |= kSCANF_DestString;
                        c++;
                        break;

                    default:
                        return nassigned;
                }
            }

            if( !( flag & kSCANF_DestMask ) )
            {
                /* Format strings are exhausted. */
                return nassigned;
            }

            if( !field_width )
            {
                /* Large than length of a line. */
                field_width = 99;
            }

            /* Matching strings in input streams and assign to argument. */
            switch( flag & kSCANF_DestMask )
            {
                case kSCANF_DestChar:
                    s = ( const char * ) p;
                    buf = va_arg( args_ptr, char * );

                    while( ( field_width-- ) && ( *p ) )
                    {
                        if( !( flag & kSCANF_Suppress ) )
                        {
                            *buf++ = *p++;
                        }
                        else
                        {
                            p++;
                        }

                        n_decode++;
                    }

                    if( ( !( flag & kSCANF_Suppress ) ) && ( s != p ) )
                    {
                        nassigned++;
                    }

                    break;

                case kSCANF_DestString:
                    n_decode += ScanIgnoreWhiteSpace( &p );
                    s = p;
                    buf = va_arg( args_ptr, char * );

                    while( ( field_width-- ) && ( *p != '\0' ) && ( *p != ' ' ) && ( *p != '\t' ) && ( *p != '\n' ) &&
                           ( *p != '\r' ) && ( *p != '\v' ) && ( *p != '\f' ) )
                    {
                        if( flag & kSCANF_Suppress )
                        {
                            p++;
                        }
                        else
                        {
                            *buf++ = *p++;
                        }

                        n_decode++;
                    }

                    if( ( !( flag & kSCANF_Suppress ) ) && ( s != p ) )
                    {
                        /* Add NULL to end of string. */
                        *buf = '\0';
                        nassigned++;
                    }

                    break;

                case kSCANF_DestInt:
                    n_decode += ScanIgnoreWhiteSpace( &p );
                    s = p;
                    val = 0;

                    if( ( base == 0 ) || ( base == 16 ) )
                    {
                        if( ( s[ 0 ] == '0' ) && ( ( s[ 1 ] == 'x' ) || ( s[ 1 ] == 'X' ) ) )
                        {
                            base = 16;

                            if( field_width >= 1 )
                            {
                                p += 2;
                                n_decode += 2;
                                field_width -= 2;
                            }
                        }
                    }

                    if( base == 0 )
                    {
                        if( s[ 0 ] == '0' )
                        {
                            base = 8;
                        }
                        else
                        {
                            base = 10;
                        }
                    }

                    neg = 1;

                    switch( *p )
                    {
                        case '-':
                            neg = -1;
                            n_decode++;
                            p++;
                            field_width--;
                            break;

