FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/utilities/fsl_str.c
                        case '+':
                            neg = 1;
                            n_decode++;
                            p++;
                            field_width--;
                            break;

                        default:
                            break;
                    }

                    while( ( *p ) && ( field_width-- ) )
                    {
                        if( ( *p <= '9' ) && ( *p >= '0' ) )
                        {
                            temp = *p - '0';
                        }
                        else if( ( *p <= 'f' ) && ( *p >= 'a' ) )
                        {
                            temp = *p - 'a' + 10;
                        }
                        else if( ( *p <= 'F' ) && ( *p >= 'A' ) )
                        {
                            temp = *p - 'A' + 10;
                        }
                        else
                        {
                            temp = base;
                        }

                        if( temp >= base )
                        {
                            break;
                        }
                        else
                        {
                            val = base * val + temp;
                        }

                        p++;
                        n_decode++;
                    }

                    val *= neg;

                    if( !( flag & kSCANF_Suppress ) )
                    {
                        #if SCANF_ADVANCED_ENABLE
                            switch( flag & kSCANF_LengthMask )
                            {
                                case kSCANF_LengthChar:

                                    if( flag & kSCANF_TypeSinged )
                                    {
                                        *va_arg( args_ptr, signed char * ) = ( signed char ) val;
                                    }
                                    else
                                    {
                                        *va_arg( args_ptr, unsigned char * ) = ( unsigned char ) val;
                                    }

                                    break;

                                case kSCANF_LengthShortInt:

                                    if( flag & kSCANF_TypeSinged )
                                    {
                                        *va_arg( args_ptr, signed short * ) = ( signed short ) val;
                                    }
                                    else
                                    {
                                        *va_arg( args_ptr, unsigned short * ) = ( unsigned short ) val;
                                    }

                                    break;

                                case kSCANF_LengthLongInt:

                                    if( flag & kSCANF_TypeSinged )
                                    {
                                        *va_arg( args_ptr, signed long int * ) = ( signed long int ) val;
                                    }
                                    else
                                    {
                                        *va_arg( args_ptr, unsigned long int * ) = ( unsigned long int ) val;
                                    }

                                    break;

                                case kSCANF_LengthLongLongInt:

                                    if( flag & kSCANF_TypeSinged )
                                    {
                                        *va_arg( args_ptr, signed long long int * ) = ( signed long long int ) val;
                                    }
                                    else
                                    {
                                        *va_arg( args_ptr, unsigned long long int * ) = ( unsigned long long int ) val;
                                    }

                                    break;

                                default:

                                    /* The default type is the type int. */
                                    if( flag & kSCANF_TypeSinged )
                                    {
                                        *va_arg( args_ptr, signed int * ) = ( signed int ) val;
                                    }
                                    else
                                    {
                                        *va_arg( args_ptr, unsigned int * ) = ( unsigned int ) val;
                                    }

                                    break;
                            }
                        #else  /* if SCANF_ADVANCED_ENABLE */
                            /* The default type is the type int. */
                            if( flag & kSCANF_TypeSinged )
                            {
                                *va_arg( args_ptr, signed int * ) = ( signed int ) val;
                            }
                            else
                            {
                                *va_arg( args_ptr, unsigned int * ) = ( unsigned int ) val;
                            }
                        #endif /* SCANF_ADVANCED_ENABLE */
                        nassigned++;
                    }

                    break;

                    #if SCANF_FLOAT_ENABLE
                        case kSCANF_DestFloat:
                            n_decode += ScanIgnoreWhiteSpace( &p );
                            fnum = strtod( p, ( char ** ) &s );

                            if( ( fnum >= HUGE_VAL ) || ( fnum <= -HUGE_VAL ) )
                            {
                                break;
                            }

                            n_decode += ( int ) ( s ) - ( int ) ( p );
                            p = s;

                            if( !( flag & kSCANF_Suppress ) )
                            {
                                if( flag & kSCANF_LengthLongLongDouble )
                                {
                                    *va_arg( args_ptr, double * ) = fnum;
                                }
                                else
                                {
                                    *va_arg( args_ptr, float * ) = ( float ) fnum;
                                }

                                nassigned++;
                            }
                            break;
                    #endif /* SCANF_FLOAT_ENABLE */
                default:
                    return nassigned;
            }
        }
    }

    return nassigned;
}
